app/controllers/front_controller.rb

def number
  user = User.find(:first,:conditions=>['user_aid = ?',params[:id]])
---
SELECT * FROM `users` WHERE (user_aid = '6095') LIMIT 1